In [1]:
import numpy as np
import pandas as pd

In [4]:
pop=pd.read_csv('state-population.csv')
areas=pd.read_csv('state-areas.csv')
abbrevs=pd.read_csv('state-abbrevs.csv')

In [5]:
pop.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [6]:
areas.head()

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [7]:
abbrevs.head()

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [8]:
merged=pd.merge(pop,abbrevs, how='outer', left_on='state/region', right_on='abbreviation')
merged

     state/region     ages  year  population    state abbreviation
0              AK    total  1990    553290.0   Alaska           AK
1              AK  under18  1990    177502.0   Alaska           AK
2              AK    total  1992    588736.0   Alaska           AK
3              AK  under18  1991    182180.0   Alaska           AK
4              AK  under18  1992    184878.0   Alaska           AK
...           ...      ...   ...         ...      ...          ...
2539           WY  under18  1993    137458.0  Wyoming           WY
2540           WY    total  1991    459260.0  Wyoming           WY
2541           WY  under18  1991    136720.0  Wyoming           WY
2542           WY  under18  1990    136078.0  Wyoming           WY
2543           WY    total  1990    453690.0  Wyoming           WY

[2544 rows x 6 columns]

In [12]:
merged=merged.drop('abbreviation', axis=1)
merged.head()

  state/region     ages  year  population   state
0           AK    total  1990    553290.0  Alaska
1           AK  under18  1990    177502.0  Alaska
2           AK    total  1992    588736.0  Alaska
3           AK  under18  1991    182180.0  Alaska
4           AK  under18  1992    184878.0  Alaska

In [ ]:
#null값이 있는 행을 찾아본다.

In [13]:
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [ ]:
#population의 어디에 널값이 있는지 찾는다.

In [14]:
merged[merged['population'].isnull()].head()

     state/region     ages  year  population state
1872           PR  under18  1990         NaN   NaN
1873           PR    total  1990         NaN   NaN
1874           PR    total  1991         NaN   NaN
1875           PR  under18  1991         NaN   NaN
1876           PR    total  1993         NaN   NaN

In [16]:
merged.loc[merged['state'].isnull(), 'state/region'].unique()

array(['PR', 'USA'], dtype=object)

In [17]:
merged.loc[merged['state/region'] == 'PR', 'state'] = 'Puerto Rico'
merged.loc[merged['state/region'] == 'USA', 'state'] = 'United States'
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [18]:
final=pd.merge(merged, areas, on='state', how='left')
final.head()

  state/region     ages  year  population   state  area (sq. mi)
0           AK    total  1990    553290.0  Alaska       656425.0
1           AK  under18  1990    177502.0  Alaska       656425.0
2           AK    total  1992    588736.0  Alaska       656425.0
3           AK  under18  1991    182180.0  Alaska       656425.0
4           AK  under18  1992    184878.0  Alaska       656425.0

In [19]:
final.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [ ]:
#area값에 널값이 있음

In [20]:
final['state'][final['area (sq. mi)'].isnull()].unique()

array(['United States'], dtype=object)

In [ ]:
#미국 전체 면적은 필요없으므로 삭제

In [21]:
final.dropna(inplace=True)
final.head()

  state/region     ages  year  population   state  area (sq. mi)
0           AK    total  1990    553290.0  Alaska       656425.0
1           AK  under18  1990    177502.0  Alaska       656425.0
2           AK    total  1992    588736.0  Alaska       656425.0
3           AK  under18  1991    182180.0  Alaska       656425.0
4           AK  under18  1992    184878.0  Alaska       656425.0

In [ ]:
#2011년에 18세 이하의 인구를 내림차순으로 정리해서 상위5개를 뽑는다.

In [26]:
data18=final.query("year==2011 & ages=='under18'").sort_values(by='population', ascending=False).head(5)
data18

     state/region     ages  year  population       state  area (sq. mi)
194            CA  under18  2011   9252336.0  California       163707.0
2156           TX  under18  2011   6931758.0       Texas       268601.0
1635           NY  under18  2011   4294555.0    New York        54475.0
476            FL  under18  2011   4002550.0     Florida        65758.0
717            IL  under18  2011   3089833.0    Illinois        57918.0

In [ ]:
#data18의 인구밀도를 내림차순으로 정리-> 2011 인구밀도를 내림차순으로 해야 함

In [29]:
data18.set_index('state', inplace=True)
density=data18['population']/data18['area (sq. mi)']
density.sort_values(ascending=False, inplace=True)
density.head()

state
New York      78.835337
Florida       60.867879
California    56.517657
Illinois      53.348406
Texas         25.806896
dtype: float64

In [30]:
data2011=final.query("year==2011").sort_values(by='population', ascending=False).head(5)

In [31]:
data2011.set_index('state', inplace=True)
den2011=data2011['population']/data18['area (sq. mi)']
den2011.sort_values(ascending=False, inplace=True)
den2011.head()

state
New York      358.012446
Florida       290.207762
California    230.098169
Illinois      221.968473
Texas          95.460959
dtype: float64

In [35]:
import pandas as pd

# 판매 데이터 생성
data = {
    'Date': ['2024-01-01', '2024-01-01', '2024-01-02', '2024-01-02'],
    'Product': ['A', 'B', 'A', 'B'],
    'Sales': [100, 200, 150, 250],
    'Region': ['East', 'West', 'East', 'West']
}
df = pd.DataFrame(data)

# 피벗 테이블 생성
pivot_table = df.pivot_table(index='Date', columns='Product', values='Sales', aggfunc='sum')
# pivot_table_with_region = df.pivot_table(index='Date', columns='Product', values='Sales', aggfunc='sum', fill_value=0)


print(pivot_table)

Product       A    B
Date
2024-01-01  100  200
2024-01-02  150  250